OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef at line 68187.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/floorplan/16-pdn.def
[INFO ODB-0128] Design: RISC_SPM
[INFO ODB-0130]     Created 36 pins.
[INFO ODB-0131]     Created 9471 components and 58316 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 32604 connections.
[INFO ODB-0133]     Created 6517 nets and 25712 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/floorplan/16-pdn.def
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 435160 440640
[INFO GPL-0006] NumInstances: 9471
[INFO GPL-0007] NumPlaceInstances: 6515
[INFO GPL-0008] NumFixedInstances: 2956
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 6517
[INFO GPL-0011] NumPins: 25746
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 440850 451570
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 435160 440640
[INFO GPL-0016] CoreArea: 184642086400
[INFO GPL-0017] NonPlaceInstsArea: 4489305600
[INFO GPL-0018] PlaceInstsArea: 92367337600
[INFO GPL-0019] Util(%): 51.27
[INFO GPL-0020] StdInstsArea: 92367337600
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG Error: 0.00098147 HPWL: 82112290
[InitialPlace]  Iter: 2 CG Error: 0.00025028 HPWL: 87925215
[InitialPlace]  Iter: 3 CG Error: 0.00007949 HPWL: 88808132
[InitialPlace]  Iter: 4 CG Error: 0.00053923 HPWL: 89163470
[InitialPlace]  Iter: 5 CG Error: 0.00035439 HPWL: 89292339
[InitialPlace]  Iter: 6 CG Error: 0.00006194 HPWL: 89376147
[InitialPlace]  Iter: 7 CG Error: 0.00072689 HPWL: 89441914
[InitialPlace]  Iter: 8 CG Error: 0.00006290 HPWL: 89498556
[InitialPlace]  Iter: 9 CG Error: 0.00006239 HPWL: 89549787
[InitialPlace]  Iter: 10 CG Error: 0.00003948 HPWL: 89609086
[InitialPlace]  Iter: 11 CG Error: 0.00004003 HPWL: 89661601
[InitialPlace]  Iter: 12 CG Error: 0.00003121 HPWL: 89683578
[InitialPlace]  Iter: 13 CG Error: 0.00002055 HPWL: 89719190
[InitialPlace]  Iter: 14 CG Error: 0.00003156 HPWL: 89742446
[InitialPlace]  Iter: 15 CG Error: 0.00001451 HPWL: 89770131
[InitialPlace]  Iter: 16 CG Error: 0.00002834 HPWL: 89793281
[InitialPlace]  Iter: 17 CG Error: 0.00000446 HPWL: 89809482
[INFO GPL-0031] FillerInit: NumGCells: 7247
[INFO GPL-0032] FillerInit: NumGNets: 6517
[INFO GPL-0033] FillerInit: NumGPins: 25746
[INFO GPL-0023] TargetDensity: 0.57
[INFO GPL-0024] AveragePlaceInstArea: 14177641
[INFO GPL-0025] IdealBinArea: 24873054
[INFO GPL-0026] IdealBinCnt: 7423
[INFO GPL-0027] TotalBinArea: 184642086400
[INFO GPL-0028] BinCnt: 64 64
[INFO GPL-0029] BinSize: 6714 6715
[INFO GPL-0030] NumBins: 4096
[NesterovSolve] Iter: 1 overflow: 0.99227 HPWL: 31065941
[NesterovSolve] Iter: 10 overflow: 0.982528 HPWL: 38564539
[NesterovSolve] Iter: 20 overflow: 0.981074 HPWL: 38710167
[NesterovSolve] Iter: 30 overflow: 0.980351 HPWL: 38818348
[NesterovSolve] Iter: 40 overflow: 0.979774 HPWL: 38842124
[NesterovSolve] Iter: 50 overflow: 0.978815 HPWL: 38916673
[NesterovSolve] Iter: 60 overflow: 0.978353 HPWL: 38972107
[NesterovSolve] Iter: 70 overflow: 0.978421 HPWL: 38999572
[NesterovSolve] Iter: 80 overflow: 0.978302 HPWL: 38997579
[NesterovSolve] Iter: 90 overflow: 0.977405 HPWL: 38986779
[NesterovSolve] Iter: 100 overflow: 0.978437 HPWL: 38981014
[NesterovSolve] Iter: 110 overflow: 0.978738 HPWL: 38987094
[NesterovSolve] Iter: 120 overflow: 0.977913 HPWL: 39040245
[NesterovSolve] Iter: 130 overflow: 0.978292 HPWL: 39096722
[NesterovSolve] Iter: 140 overflow: 0.976999 HPWL: 39256797
[NesterovSolve] Iter: 150 overflow: 0.976949 HPWL: 39646509
[NesterovSolve] Iter: 160 overflow: 0.975759 HPWL: 40467932
[NesterovSolve] Iter: 170 overflow: 0.973581 HPWL: 42768304
[NesterovSolve] Iter: 180 overflow: 0.969008 HPWL: 46534371
[NesterovSolve] Iter: 190 overflow: 0.962868 HPWL: 50534194
[NesterovSolve] Iter: 200 overflow: 0.95555 HPWL: 54409633
[NesterovSolve] Iter: 210 overflow: 0.946535 HPWL: 58864231
[NesterovSolve] Iter: 220 overflow: 0.931837 HPWL: 64078472
[NesterovSolve] Iter: 230 overflow: 0.910922 HPWL: 71595728
[NesterovSolve] Iter: 240 overflow: 0.883986 HPWL: 79857476
[NesterovSolve] Iter: 250 overflow: 0.858168 HPWL: 86751687
[NesterovSolve] Iter: 260 overflow: 0.828523 HPWL: 94676740
[NesterovSolve] Iter: 270 overflow: 0.786624 HPWL: 104077871
[INFO GPL-0100] worst slack 1e+30
[WARNING GPL-0102] No slacks found. Timing-driven mode disabled.
[NesterovSolve] Iter: 280 overflow: 0.747712 HPWL: 113050824
[NesterovSolve] Iter: 290 overflow: 0.70857 HPWL: 121812777
[NesterovSolve] Iter: 300 overflow: 0.669496 HPWL: 130481760
[NesterovSolve] Iter: 310 overflow: 0.631019 HPWL: 138838078
[NesterovSolve] Iter: 320 overflow: 0.596991 HPWL: 146234152
[NesterovSolve] Snapshot saved at iter = 319
[NesterovSolve] Iter: 330 overflow: 0.563413 HPWL: 151257474
[NesterovSolve] Iter: 340 overflow: 0.528051 HPWL: 155007133
[NesterovSolve] Iter: 350 overflow: 0.489409 HPWL: 158858381
[NesterovSolve] Iter: 360 overflow: 0.451974 HPWL: 162001117
[NesterovSolve] Iter: 370 overflow: 0.407206 HPWL: 164582599
[NesterovSolve] Iter: 380 overflow: 0.359629 HPWL: 166336655
[NesterovSolve] Iter: 390 overflow: 0.31943 HPWL: 166842722
[NesterovSolve] Iter: 400 overflow: 0.284667 HPWL: 167682936
[NesterovSolve] Iter: 410 overflow: 0.246075 HPWL: 167720581
[NesterovSolve] Iter: 420 overflow: 0.213984 HPWL: 167773553
[INFO GPL-0075] Routability numCall: 1 inflationIterCnt: 1 bloatIterCnt: 0
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 290842
[INFO GRT-0019] Found 0 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 2118
[INFO GRT-0017] Processing 297547 blockages on layer li1.
[INFO GRT-0017] Processing 64113 blockages on layer met1.
[INFO GRT-0017] Processing 6 blockages on layer met4.
[INFO GRT-0017] Processing 6 blockages on layer met5.

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical        61425         54958          10.53%
met1       Horizontal      81900         61231          25.24%
met2       Vertical        61425         61184          0.39%
met3       Horizontal      40950         40486          1.13%
met4       Vertical        24570         24332          0.97%
met5       Horizontal       8190          7998          2.34%
---------------------------------------------------------------

[INFO GRT-0111] Final number of vias: 16614
[INFO GRT-0112] Final usage 3D: 83556

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1              54958         12828           23.34%             0 /  0 /  0
met1             61231         15647           25.55%             0 /  0 /  0
met2             61184          3764            6.15%             0 /  0 /  0
met3             40486          1475            3.64%             0 /  0 /  0
met4             24332             0            0.00%             0 /  0 /  0
met5              7998             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total           250189         33714           13.48%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 354321 um
[INFO GPL-0036] TileLxLy: 0 0
[INFO GPL-0037] TileSize: 6900 6900
[INFO GPL-0038] TileCnt: 63 66
[INFO GPL-0039] numRoutingLayers: 6
[INFO GPL-0040] NumTiles: 4158
[INFO GPL-0063] TotalRouteOverflowH2: 0.0
[INFO GPL-0064] TotalRouteOverflowV2: 0.0
[INFO GPL-0065] OverflowTileCnt2: 0
[INFO GPL-0066] 0.5%RC: 1.0
[INFO GPL-0067] 1.0%RC: 0.9908333311478297
[INFO GPL-0068] 2.0%RC: 0.9566666563351949
[INFO GPL-0069] 5.0%RC: 0.8676126889872033
[INFO GPL-0070] 0.5rcK: 1.0
[INFO GPL-0071] 1.0rcK: 1.0
[INFO GPL-0072] 2.0rcK: 0.0
[INFO GPL-0073] 5.0rcK: 0.0
[INFO GPL-0074] FinalRC: 0.99541664
[NesterovSolve] Iter: 430 overflow: 0.182601 HPWL: 168064942
[NesterovSolve] Iter: 440 overflow: 0.152926 HPWL: 168436222
[NesterovSolve] Iter: 450 overflow: 0.128513 HPWL: 168798018
[NesterovSolve] Iter: 460 overflow: 0.107949 HPWL: 169222740
[NesterovSolve] Finished with Overflow: 0.099747
[WARNING STA-0053] /home/MSUCAP/tanvir.arafin/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib line 1, library sky130_fd_sc_hd__tt_025C_1v80 already exists.
###############################################################################
# Created by write_sdc
# Wed Dec  8 16:44:07 2021
###############################################################################
current_design RISC_SPM
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 300.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {address_bus[7]}]
set_load -pin_load 0.0334 [get_ports {address_bus[6]}]
set_load -pin_load 0.0334 [get_ports {address_bus[5]}]
set_load -pin_load 0.0334 [get_ports {address_bus[4]}]
set_load -pin_load 0.0334 [get_ports {address_bus[3]}]
set_load -pin_load 0.0334 [get_ports {address_bus[2]}]
set_load -pin_load 0.0334 [get_ports {address_bus[1]}]
set_load -pin_load 0.0334 [get_ports {address_bus[0]}]
set_load -pin_load 0.0334 [get_ports {data_bus[7]}]
set_load -pin_load 0.0334 [get_ports {data_bus[6]}]
set_load -pin_load 0.0334 [get_ports {data_bus[5]}]
set_load -pin_load 0.0334 [get_ports {data_bus[4]}]
set_load -pin_load 0.0334 [get_ports {data_bus[3]}]
set_load -pin_load 0.0334 [get_ports {data_bus[2]}]
set_load -pin_load 0.0334 [get_ports {data_bus[1]}]
set_load -pin_load 0.0334 [get_ports {data_bus[0]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[7]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[6]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[5]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[4]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[3]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[2]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[1]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[0]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[7]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[6]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[5]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[4]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[3]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[2]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[1]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: rst (input port clocked by clk)
Endpoint: _10873_ (removal check against rising-edge clock clk)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         60.00   60.00 ^ input external delay
                  2.95    1.87   61.87 ^ rst (in)
    69    0.37                           rst (net)
                  2.95    0.00   61.87 ^ _10873_/RESET_B (sky130_fd_sc_hd__dfrtp_2)
                                 61.87   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _10873_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          6.19    6.44   library removal time
                                  6.44   data required time
-----------------------------------------------------------------------------
                                  6.44   data required time
                                -61.87   data arrival time
-----------------------------------------------------------------------------
                                 55.43   slack (MET)


Startpoint: _10848_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _10848_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _10848_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.05    5.00    5.00 v _10848_/Q (sky130_fd_sc_hd__dfrtp_2)
     2    0.00                           M0_Processor.Mux_1.data_d[5] (net)
                  0.05    0.00    5.00 v _04550_/A1 (sky130_fd_sc_hd__a22o_2)
                  0.04    0.20    5.21 v _04550_/X (sky130_fd_sc_hd__a22o_2)
     1    0.00                           _02844_ (net)
                  0.04    0.00    5.21 v _10848_/D (sky130_fd_sc_hd__dfrtp_2)
                                  5.21   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _10848_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          4.11    4.36   library hold time
                                  4.36   data required time
-----------------------------------------------------------------------------
                                  4.36   data required time
                                 -5.21   data arrival time
-----------------------------------------------------------------------------
                                  0.85   slack (MET)


Startpoint: rst (input port clocked by clk)
Endpoint: _10823_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         60.00   60.00 ^ input external delay
                  2.95    2.30   62.30 ^ rst (in)
    69    0.37                           rst (net)
                  2.95    0.00   62.30 ^ _10823_/RESET_B (sky130_fd_sc_hd__dfrtp_2)
                                 62.30   data arrival time

                  0.15  300.00  300.00   clock clk (rise edge)
                          0.00  300.00   clock network delay (ideal)
                         -0.25  299.75   clock uncertainty
                          0.00  299.75   clock reconvergence pessimism
                                299.75 ^ _10823_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          9.68  309.43   library recovery time
                                309.43   data required time
-----------------------------------------------------------------------------
                                309.43   data required time
                                -62.30   data arrival time
-----------------------------------------------------------------------------
                                247.13   slack (MET)


Startpoint: _10827_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: memory_bus[1] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _10827_/CLK (sky130_fd_sc_hd__dfrtp_2)
                 14.52   15.61   15.61 ^ _10827_/Q (sky130_fd_sc_hd__dfrtp_2)
   523    2.15                           address_bus[0] (net)
                 14.53    0.24   15.85 ^ _08215_/S0 (sky130_fd_sc_hd__mux4_1)
                  0.36    2.66   18.51 ^ _08215_/X (sky130_fd_sc_hd__mux4_1)
     1    0.01                           _00205_ (net)
                  0.36    0.00   18.51 ^ _08218_/A1 (sky130_fd_sc_hd__mux4_1)
                  0.25    0.47   18.98 ^ _08218_/X (sky130_fd_sc_hd__mux4_1)
     1    0.02                           _00208_ (net)
                  0.25    0.00   18.98 ^ _08234_/A0 (sky130_fd_sc_hd__mux4_1)
                  0.37    0.55   19.52 ^ _08234_/X (sky130_fd_sc_hd__mux4_1)
     1    0.04                           _00224_ (net)
                  0.37    0.00   19.53 ^ _08256_/A2 (sky130_fd_sc_hd__mux4_1)
                  1.15    1.19   20.72 ^ _08256_/X (sky130_fd_sc_hd__mux4_1)
     2    0.04                           memory_bus[1] (net)
                  1.15    0.02   20.74 ^ memory_bus[1] (out)
                                 20.74   data arrival time

                  0.15  300.00  300.00   clock clk (rise edge)
                          0.00  300.00   clock network delay (ideal)
                         -0.25  299.75   clock uncertainty
                          0.00  299.75   clock reconvergence pessimism
                        -60.00  239.75   output external delay
                                239.75   data required time
-----------------------------------------------------------------------------
                                239.75   data required time
                                -20.74   data arrival time
-----------------------------------------------------------------------------
                                219.01   slack (MET)


min_max_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
