OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef at line 68187.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/placement/18-replace.def
[INFO ODB-0128] Design: RISC_SPM
[INFO ODB-0130]     Created 36 pins.
[INFO ODB-0131]     Created 9471 components and 58316 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 32604 connections.
[INFO ODB-0133]     Created 6517 nets and 25712 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/placement/18-replace.def
###############################################################################
# Created by write_sdc
# Wed Dec  8 16:44:07 2021
###############################################################################
current_design RISC_SPM
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 300.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {address_bus[7]}]
set_load -pin_load 0.0334 [get_ports {address_bus[6]}]
set_load -pin_load 0.0334 [get_ports {address_bus[5]}]
set_load -pin_load 0.0334 [get_ports {address_bus[4]}]
set_load -pin_load 0.0334 [get_ports {address_bus[3]}]
set_load -pin_load 0.0334 [get_ports {address_bus[2]}]
set_load -pin_load 0.0334 [get_ports {address_bus[1]}]
set_load -pin_load 0.0334 [get_ports {address_bus[0]}]
set_load -pin_load 0.0334 [get_ports {data_bus[7]}]
set_load -pin_load 0.0334 [get_ports {data_bus[6]}]
set_load -pin_load 0.0334 [get_ports {data_bus[5]}]
set_load -pin_load 0.0334 [get_ports {data_bus[4]}]
set_load -pin_load 0.0334 [get_ports {data_bus[3]}]
set_load -pin_load 0.0334 [get_ports {data_bus[2]}]
set_load -pin_load 0.0334 [get_ports {data_bus[1]}]
set_load -pin_load 0.0334 [get_ports {data_bus[0]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[7]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[6]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[5]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[4]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[3]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[2]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[1]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[0]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[7]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[6]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[5]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[4]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[3]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[2]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[1]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 1 input buffers.
[INFO RSZ-0028] Inserted 32 output buffers.
[INFO RSZ-0058] Using max wire length 2319um.
[INFO RSZ-0034] Found 12 slew violations.
[INFO RSZ-0036] Found 10 capacitance violations.
[INFO RSZ-0038] Inserted 27 buffers in 12 nets.
[INFO RSZ-0039] Resized 5392 instances.
Placement Analysis
---------------------------------
total displacement      27008.3 u
average displacement        2.8 u
max displacement           35.9 u
original HPWL          181486.9 u
legalized HPWL         210240.7 u
delta HPWL                   16 %

[INFO DPL-0020] Mirrored 2867 instances
[INFO DPL-0021] HPWL before          210240.7 u
[INFO DPL-0022] HPWL after           203586.8 u
[INFO DPL-0023] HPWL delta               -3.2 %
