OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef at line 68187.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/results/placement/RISC_SPM.placement.def
[INFO ODB-0128] Design: RISC_SPM
[INFO ODB-0130]     Created 36 pins.
[INFO ODB-0131]     Created 9531 components and 58676 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 32844 connections.
[INFO ODB-0133]     Created 6577 nets and 25832 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/RISC_SPM/runs/RUN_2021.12.08_16.43.47/results/placement/RISC_SPM.placement.def
###############################################################################
# Created by write_sdc
# Wed Dec  8 16:44:28 2021
###############################################################################
current_design RISC_SPM
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 300.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {address_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_bus[7]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[0]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[1]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[2]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[3]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[4]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[5]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[6]}]
set_output_delay 60.0000 -clock [get_clocks {clk}] -add_delay [get_ports {memory_bus[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {address_bus[7]}]
set_load -pin_load 0.0334 [get_ports {address_bus[6]}]
set_load -pin_load 0.0334 [get_ports {address_bus[5]}]
set_load -pin_load 0.0334 [get_ports {address_bus[4]}]
set_load -pin_load 0.0334 [get_ports {address_bus[3]}]
set_load -pin_load 0.0334 [get_ports {address_bus[2]}]
set_load -pin_load 0.0334 [get_ports {address_bus[1]}]
set_load -pin_load 0.0334 [get_ports {address_bus[0]}]
set_load -pin_load 0.0334 [get_ports {data_bus[7]}]
set_load -pin_load 0.0334 [get_ports {data_bus[6]}]
set_load -pin_load 0.0334 [get_ports {data_bus[5]}]
set_load -pin_load 0.0334 [get_ports {data_bus[4]}]
set_load -pin_load 0.0334 [get_ports {data_bus[3]}]
set_load -pin_load 0.0334 [get_ports {data_bus[2]}]
set_load -pin_load 0.0334 [get_ports {data_bus[1]}]
set_load -pin_load 0.0334 [get_ports {data_bus[0]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[7]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[6]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[5]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[4]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[3]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[2]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[1]}]
set_load -pin_load 0.0334 [get_ports {instruction_bus[0]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[7]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[6]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[5]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[4]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[3]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[2]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[1]}]
set_load -pin_load 0.0334 [get_ports {memory_bus[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
[INFO]: Configuring cts characterization...
[INFO]: Performing clock tree synthesis...
[INFO]: Looking for the following net(s): clk
[INFO]: Running Clock Tree Synthesis...
[INFO CTS-0038] Number of created patterns = 50000.
[INFO CTS-0038] Number of created patterns = 100000.
[INFO CTS-0039] Number of created patterns = 137808.
[INFO CTS-0084] Compiling LUT.
Min. len    Max. len    Min. cap    Max. cap    Min. slew   Max. slew
2           8           1           36          1           150         
[WARNING CTS-0043] 4752 wires are pure wire and no slew degradation.
TritonCTS forced slew degradation on these wires.
[INFO CTS-0046]     Number of wire segments: 136611.
[INFO CTS-0047]     Number of keys in characterization LUT: 1923.
[INFO CTS-0048]     Actual min input cap: 1.
[INFO CTS-0001] Running TritonCTS with user-specified clock roots: clk.
[INFO CTS-0095] Net "clk" found.
[INFO CTS-0010]  Clock net "clk" has 2117 sinks.
[INFO CTS-0008] TritonCTS found 1 clock nets.
[INFO CTS-0097] Characterization used 3 buffer(s) types.
[INFO CTS-0027] Generating H-Tree topology for net clk.
[INFO CTS-0028]  Total number of sinks: 2117.
[INFO CTS-0029]  Sinks will be clustered in groups of up to 25 and with maximum cluster diameter of 50.0 um.
[INFO CTS-0030]  Number of static layers: 0.
[INFO CTS-0020]  Wire segment unit: 13000  dbu (13 um).
[INFO CTS-0019]  Total number of sinks after clustering: 169.
[INFO CTS-0024]  Normalized sink region: [(0.989923, 1.36), (32.3429, 33.2328)].
[INFO CTS-0025]     Width:  31.3530.
[INFO CTS-0026]     Height: 31.8728.
 Level 1
    Direction: Vertical
    Sinks per sub-region: 85
    Sub-region size: 31.3530 X 15.9364
[INFO CTS-0034]     Segment length (rounded): 8.
    Key: 4068 outSlew: 13 load: 1 length: 8 isBuffered: true
 Level 2
    Direction: Horizontal
    Sinks per sub-region: 43
    Sub-region size: 15.6765 X 15.9364
[INFO CTS-0034]     Segment length (rounded): 8.
    Key: 4079 outSlew: 13 load: 1 length: 8 isBuffered: true
 Level 3
    Direction: Vertical
    Sinks per sub-region: 22
    Sub-region size: 15.6765 X 7.9682
[INFO CTS-0034]     Segment length (rounded): 4.
    Key: 173 outSlew: 7 load: 1 length: 4 isBuffered: true
 Level 4
    Direction: Horizontal
    Sinks per sub-region: 11
    Sub-region size: 7.8383 X 7.9682
[INFO CTS-0034]     Segment length (rounded): 4.
    Key: 167 outSlew: 7 load: 1 length: 4 isBuffered: true
[INFO CTS-0032]  Stop criterion found. Max number of sinks is 15.
[INFO CTS-0035]  Number of sinks covered: 169.
[INFO CTS-0036]  Average source sink dist: 19737.71 dbu.
[INFO CTS-0037]  Number of outlier sinks: 0.
[INFO CTS-0018]     Created 198 clock buffers.
[INFO CTS-0012]     Minimum number of buffers in the clock path: 5.
[INFO CTS-0013]     Maximum number of buffers in the clock path: 6.
[INFO CTS-0015]     Created 198 clock nets.
[INFO CTS-0016]     Fanout distribution for the current clock = 2:1, 4:2, 5:3, 6:1, 7:3, 8:12, 9:13, 10:21, 11:22, 12:17, 13:21, 14:21, 15:10, 16:10, 17:9, 18:3, 19:6, 20:5, 21:1, 22:2..
[INFO CTS-0017]     Max level of the clock tree: 4.
[INFO CTS-0098] Clock net "clk"
[INFO CTS-0099]  Sinks 2117
[INFO CTS-0100]  Leaf buffers 167
[INFO CTS-0101]  Average sink wire length 624.0 um
[INFO CTS-0102]  Path depth 5 - 6
[INFO]: Repairing long wires on clock nets...
[INFO RSZ-0058] Using max wire length 2319um.
[INFO]: Legalizing...
Placement Analysis
---------------------------------
total displacement       2572.3 u
average displacement        0.3 u
max displacement           17.3 u
original HPWL          217846.2 u
legalized HPWL         226389.4 u
delta HPWL                    4 %

[INFO DPL-0020] Mirrored 2926 instances
[INFO DPL-0021] HPWL before          226389.4 u
[INFO DPL-0022] HPWL after           219002.6 u
[INFO DPL-0023] HPWL delta               -3.3 %
cts_report
[INFO CTS-0003] Total number of Clock Roots: 1.
[INFO CTS-0004] Total number of Buffers Inserted: 198.
[INFO CTS-0005] Total number of Clock Subnets: 198.
[INFO CTS-0006] Total number of Sinks: 2117.
cts_report_end
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: rst (input port clocked by clk)
Endpoint: _10874_ (removal check against rising-edge clock clk)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                         60.00   60.00 ^ input external delay
                  0.10    0.06   60.06 ^ rst (in)
     1    0.01                           rst (net)
                  0.10    0.00   60.06 ^ input1/A (sky130_fd_sc_hd__buf_12)
                  0.43    0.31   60.37 ^ input1/X (sky130_fd_sc_hd__buf_12)
    69    0.38                           net1 (net)
                  0.44    0.05   60.42 ^ _10874_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                 60.42   data arrival time

                          0.00    0.00   clock clk (rise edge)
                          2.19    2.19   clock network delay (propagated)
                          0.25    2.44   clock uncertainty
                          0.00    2.44   clock reconvergence pessimism
                                  2.44 ^ _10874_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.44    2.88   library removal time
                                  2.88   data required time
-----------------------------------------------------------------------------
                                  2.88   data required time
                                -60.42   data arrival time
-----------------------------------------------------------------------------
                                 57.54   slack (MET)


Startpoint: _09086_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _09086_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk (rise edge)
                          1.62    1.62   clock network delay (propagated)
                  0.06    0.00    1.62 ^ _09086_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.29    1.90 ^ _09086_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           M2_SRAM.memory[133][7] (net)
                  0.06    0.00    1.90 ^ _07457_/A1 (sky130_fd_sc_hd__a22o_1)
                  0.04    0.11    2.01 ^ _07457_/X (sky130_fd_sc_hd__a22o_1)
     1    0.00                           _01086_ (net)
                  0.04    0.00    2.01 ^ _09086_/D (sky130_fd_sc_hd__dfxtp_1)
                                  2.01   data arrival time

                          0.00    0.00   clock clk (rise edge)
                          1.98    1.98   clock network delay (propagated)
                          0.25    2.23   clock uncertainty
                         -0.36    1.87   clock reconvergence pessimism
                                  1.87 ^ _09086_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.03    1.84   library hold time
                                  1.84   data required time
-----------------------------------------------------------------------------
                                  1.84   data required time
                                 -2.01   data arrival time
-----------------------------------------------------------------------------
                                  0.17   slack (MET)


Startpoint: rst (input port clocked by clk)
Endpoint: _10837_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                         60.00   60.00 ^ input external delay
                  0.10    0.07   60.07 ^ rst (in)
     1    0.01                           rst (net)
                  0.10    0.00   60.07 ^ input1/A (sky130_fd_sc_hd__buf_12)
                  0.43    0.38   60.46 ^ input1/X (sky130_fd_sc_hd__buf_12)
    69    0.38                           net1 (net)
                  0.44    0.06   60.52 ^ _10837_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                 60.52   data arrival time

                        300.00  300.00   clock clk (rise edge)
                          1.49  301.49   clock network delay (propagated)
                         -0.25  301.24   clock uncertainty
                          0.00  301.24   clock reconvergence pessimism
                                301.24 ^ _10837_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.29  301.53   library recovery time
                                301.53   data required time
-----------------------------------------------------------------------------
                                301.53   data required time
                                -60.52   data arrival time
-----------------------------------------------------------------------------
                                241.01   slack (MET)


Startpoint: _10827_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: memory_bus[2] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk (rise edge)
                          2.15    2.15   clock network delay (propagated)
                  0.08    0.00    2.15 ^ _10827_/CLK (sky130_fd_sc_hd__dfrtp_4)
                  0.83    1.09    3.23 ^ _10827_/Q (sky130_fd_sc_hd__dfrtp_4)
    42    0.30                           net2 (net)
                  0.83    0.01    3.24 ^ repeater58/A (sky130_fd_sc_hd__buf_12)
                  0.42    0.50    3.74 ^ repeater58/X (sky130_fd_sc_hd__buf_12)
    58    0.38                           net58 (net)
                  0.42    0.00    3.74 ^ repeater57/A (sky130_fd_sc_hd__buf_12)
                  0.43    0.45    4.19 ^ repeater57/X (sky130_fd_sc_hd__buf_12)
    56    0.38                           net57 (net)
                  0.43    0.04    4.23 ^ repeater54/A (sky130_fd_sc_hd__buf_12)
                  0.49    0.51    4.74 ^ repeater54/X (sky130_fd_sc_hd__buf_12)
    67    0.44                           net54 (net)
                  0.50    0.05    4.79 ^ _08289_/S0 (sky130_fd_sc_hd__mux4_1)
                  0.12    0.74    5.53 v _08289_/X (sky130_fd_sc_hd__mux4_1)
     1    0.01                           _00278_ (net)
                  0.12    0.00    5.53 v _08292_/A1 (sky130_fd_sc_hd__mux4_1)
                  0.10    0.61    6.14 v _08292_/X (sky130_fd_sc_hd__mux4_1)
     1    0.01                           _00281_ (net)
                  0.10    0.00    6.14 v _08298_/A2 (sky130_fd_sc_hd__mux4_2)
                  0.15    0.64    6.78 v _08298_/X (sky130_fd_sc_hd__mux4_2)
     1    0.03                           _00287_ (net)
                  0.15    0.00    6.78 v _08341_/A1 (sky130_fd_sc_hd__mux4_2)
                  0.25    0.78    7.56 v _08341_/X (sky130_fd_sc_hd__mux4_2)
     2    0.08                           net28 (net)
                  0.25    0.01    7.57 v output28/A (sky130_fd_sc_hd__buf_2)
                  0.09    0.30    7.87 v output28/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           memory_bus[2] (net)
                  0.09    0.00    7.87 v memory_bus[2] (out)
                                  7.87   data arrival time

                        300.00  300.00   clock clk (rise edge)
                          0.00  300.00   clock network delay (propagated)
                         -0.25  299.75   clock uncertainty
                          0.00  299.75   clock reconvergence pessimism
                        -60.00  239.75   output external delay
                                239.75   data required time
-----------------------------------------------------------------------------
                                239.75   data required time
                                 -7.87   data arrival time
-----------------------------------------------------------------------------
                                231.88   slack (MET)


min_max_report_end
clock_skew_report
Clock clk
Latency      CRPR       Skew
_10873_/CLK ^
   2.19
_08909_/CLK ^
   1.40     -0.09       0.70

clock_skew_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
